// pages/consult/consult.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
     showdetail:false,
     questext:"",
     answertext:"",
     question: [
       {
         id: 1,
         q: "如何预订别野网房屋？",
         a: "首先在别野网找到你喜欢的房屋，然后在该房屋详情页点击“立即预订”按钮，进行在线预订。同时您还可以致电别野网客服中心 (010-82228412) 进行电话预订。",
       }, {
         id: 2,
         q: "在别野网预订房屋，需要付订金吗？",
         a: "这与入住时间和所订的房屋有关。在旺季，将按房屋或管理公司的押金规则收取部分或全部房费作为订金。",
       }, {
         id: 3,
         q: "别野网需要注册吗？",
         a: "目前用户不需要注册，即可在别野网预订房屋。别野网会使用您预订时填写的手机号码帮您自动完成注册并将登录密码发送至该手机中，同时在您忘记密码时也可以通过该手机号码找回密码。当然您仍然可以选择注册后再预订房间，系统会使用您注册时填写的资料帮您填写相关订单信息。",
       }, {
         id: 4,
         q: "提交订单后如何确认、查询订单？",
         a: "登录后在别野网首页“我的别野-我的订单”中即可查询订单信息。",
       }, {
         id: 5,
         q: "预订后，若要更改入住时间或人数，怎么办？",
         a: "您需要尽快联系别野网客服中心(010-82228412)客服人员，如果产生额外费用，需另行支付。",
       }, {
         id: 6,
         q: "如何取消预订？",
         a: "登录后在别野网首页“我的别野-我的订单”中进行取消。",
       }, {
         id: 7,
         q: "如果取消预订，在别野网预付的订金可退吗？",
         a: "房屋确认后如需取消或变更，订金的退还将按预订时所订房间相关规定执行。",
       }, {
         id: 8,
         q: "房屋可以加床吗？加床收费吗？",
         a: "部分房屋是可以提供加床的。收费标准参考房间详情页。",
       }, {
         id: 9,
         q: "如何办理入住、退房手续？",
         a: "个人中心对应板块会有相应操作",
       }, {
         id: 10,
         q: "在别野网预订度假房屋，如何支付？",
         a: "可通过网络在线支付（如：微信、支付宝）完成付款。",
       }, {
         id: 11,
         q: "提交订单后订单状态显示等待房东确认无法进行支付？",
         a: "别野网的部分房屋由别野网合作的独立管理公司管理，您的订单需要等待管理公司确认后才可以进行支付。",
       }, {
         id: 12,
         q: "怎样联系管家？",
         a: "可以通过网站的在线聊天工具与您预订别墅的管家进行沟通，也可通过电话号码联系管家。",
       }, {
         id: 13,
         q: "哪些订单可以开具发票？",
         a: "别野网对预订套餐产品、包房底价房产品的订单可以开具发票。预订别野自营和商户经营房屋的订单暂时不支持开具发票。",
       }, {
         id: 14,
         q: "别野网开具发票的金额？",
         a: "发票金额不能高于订单金额，且别野网只对您实际支付金额部分开具发票。",
       }, {
         id: 15,
         q: "需要在多长时间内申请开具发票？",
         a: "您应在离店后30天内申请开具发票。",
       }, {
         id: 16,
         q: "别野网开具发票的抬头是什么？",
         a: "发票抬头您可选择填写个人或公司名称。",
       }, {
         id: 17,
         q: "发票在多长时间可以开具？怎么送达到我手中？",
         a: "发票将在您提出发票开具申请后3-5个工作日内为您开具并邮寄给您录入的地址，如果您在超过10个工作日仍然未收到发票，请与别野网客服联系。",
       }, {
         id: 18,
         q: "如果申请开具发票时发票抬头录入错误是否可以申请重开？",
         a: "不能，所以在录入发票信息时一定要填写正确。",
       }
     ],
  },

  /**
   * 生命周期函数--监听页面加载
   */

  showdetail:function(event){
    var qid = event.currentTarget.dataset.id;
    console.log(qid);
    var data = this.data.question;
   for(let i=0;i<data.length;i++){
     if (data[i].id == qid){
       var answer= data[i].a;
       var quest=data[i].q;
       this.setData({
         showdetail: true,
         answertext: answer,
         questext: quest
       })
     }
   }
  },
  calling: function () {
    wx.makePhoneCall({
      phoneNumber: '010-82228412', //此号码并非真实电话号码，仅用于测试
      success: function () {
        console.log("拨打电话成功！")
      },
      fail: function () {
        console.log("拨打电话失败！")
      }
    })
  },
  back:function(){
    this.setData({
      showdetail: false,
      answertext: "",
      questext: ""
    })
  },
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})